var area = [
  {
    "name": "北京",
    "id": "110000",
    "child": [
      {
        "id": "110101",
        "city": "市辖区",
        "name": "东城区"
      },
      {
          "id": "110102",
          "city": "市辖区",
          "name": "西城区"
      },
      {
          "id": "110103",
          "city": "市辖区",
          "name": "崇文区"
      },
      {
          "id": "110104",
          "city": "市辖区",
          "name": "宣武区"
      },
      {
          "id": "110105",
          "city": "市辖区",
          "name": "朝阳区"
      },
      {
          "id": "110106",
          "city": "市辖区",
          "name": "丰台区"
      },
      {
          "id": "110107",
          "city": "市辖区",
          "name": "石景山区"
      },
      {
          "id": "110108",
          "city": "市辖区",
          "name": "海淀区"
      },
      {
          "id": "110109",
          "city": "市辖区",
          "name": "门头沟区"
      },
      {
          "id": "110111",
          "city": "市辖区",
          "name": "房山区"
      },
      {
          "id": "110112",
          "city": "市辖区",
          "name": "通州区"
      },
      {
          "id": "110113",
          "city": "市辖区",
          "name": "顺义区"
      },
      {
          "id": "110114",
          "city": "市辖区",
          "name": "昌平区"
      },
      {
          "id": "110115",
          "city": "市辖区",
          "name": "大兴区"
      },
      {
          "id": "110116",
          "city": "市辖区",
          "name": "怀柔区"
      },
      {
          "id": "110117",
          "city": "市辖区",
          "name": "平谷区"
      }
    ]
  },
  {
    "name": "上海",
    "id": "310100",
    "child": [
        {
            "id": "310101",
            "city": "市辖区",
            "name": "黄浦区",
        },
        {
            "id": "310103",
            "city": "市辖区",
            "name": "卢湾区"
        },
        {
            "id": "310104",
            "city": "市辖区",
            "name": "徐汇区"
        },
        {
            "id": "310105",
            "city": "市辖区",
            "name": "长宁区"
        },
        {
            "id": "310106",
            "city": "市辖区",
            "name": "静安区"
        },
        {
            "id": "310107",
            "city": "市辖区",
            "name": "普陀区"
        },
        {
            "id": "310108",
            "city": "市辖区",
            "name": "闸北区"
        },
        {
            "id": "310109",
            "city": "市辖区",
            "name": "虹口区"
        },
        {
            "id": "310110",
            "city": "市辖区",
            "name": "杨浦区"
        },
        {
            "id": "310112",
            "city": "市辖区",
            "name": "闵行区"
        },
        {
            "id": "310113",
            "city": "市辖区",
            "name": "宝山区"
        },
        {
            "id": "310114",
            "city": "市辖区",
            "name": "嘉定区"
        },
        {
            "id": "310115",
            "city": "市辖区",
            "name": "浦东新区"
        },
        {
            "id": "310116",
            "city": "市辖区",
            "name": "金山区"
        },
        {
            "id": "310117",
            "city": "市辖区",
            "name": "松江区"
        },
        {
            "id": "310118",
            "city": "市辖区",
            "name": "青浦区"
        },
        {
            "id": "310119",
            "city": "市辖区",
            "name": "南汇区"
        },
        {
            "id": "310120",
            "city": "市辖区",
            "name": "奉贤区"
        }
     ]
  },
  {
      "id": "test1",
      "name": "河北",
      "child": [
        {
            "id": "woyebuzhidao",
            "name": "石家庄",
            "child": [
                {
                    "name": "请选择"
                },
                {
                    "name": "长安区"
                },
                {
                    "name": "桥东区"
                },
                {
                    "name": "桥西区"
                },
                {
                    "name": "新华区"
                },
                {
                    "name": "裕华区"
                },
                {
                    "name": "井陉矿区"
                },
                {
                    "name": "鹿泉市"
                },
                {
                    "name": "辛集市"
                },
                {
                    "name": "藁城市"
                },
                {
                    "name": "晋州市"
                },
                {
                    "name": "新乐市"
                },
                {
                    "name": "深泽县"
                },
                {
                    "name": "无极县"
                },
                {
                    "name": "赵县"
                },
                {
                    "name": "灵寿县"
                },
                {
                    "name": "高邑县"
                },
                {
                    "name": "元氏县"
                },
                {
                    "name": "赞皇县"
                },
                {
                    "name": "平山县"
                },
                {
                    "name": "井陉县"
                },
                {
                    "name": "栾城县"
                },
                {
                    "name": "正定县"
                },
                {
                    "name": "行唐县"
                },
                {
                    "name": "其他"
                }
            ],
        }
      ]
  }
]
  